init.org
#+TITLE: coldnew's emacs
#+AUTHOR: Yen-Chin, Lee <coldnew>
#+email: coldnew.tw at gmail.com
#+DESCRIPTION: A literate programming style exposition of my Emacs configuration
#+LANGUAGE: en
#+STARTUP: overview indent align
#+BABEL: :cache yes
#+OPTIONS: ^:nil num:nil tags:nil
#+SETUPFILE: assets/readtheorg.setup

#+LINK: emacs     https://www.gnu.org/s/emacs

# Badge
[[http://www.gnu.org/licenses/gpl-3.0.txt][https://img.shields.io/badge/license-GPL_3-green.svg?dummy]]

* Introduction

This is my emacs configuration, I use ONE single org-mode file to write my emacs config.

** Install emacs

My emacs is running under =Mac OSX= and =Gentoo Linux= and I really like them, following are some record for how I installed my emacs.

*** Mac OSX

In Mac OSX, I use [[http://brew.sh/][homebrew]] with [[https://github.com/daviderestivo/homebrew-emacs-head][homebrew-emacs-head]], I always install latest version of emacs via following command:

#+BEGIN_SRC sh :tangle no
  brew tap daviderestivo/emacs-head
  brew install  emacs-head@31  --with-cocoa --with-gnutls --with-mailutils --with-xwidgets --with-native-comp --with-native-full-aot --with-tree-sitter --with-libgccjit
  ln -s /opt/homebrew/opt/emacs-head@30/Emacs.app /Applications
#+END_SRC

*** Gentoo Linux

[[https://www.gentoo.org/][Gentoo Linux]] is the best linux distrobution I ever used and it's really easy to install latest apps.

#+BEGIN_SRC sh :tangle no
  USE="X gtk3 inotify xft imagemagick" emerge app-editors/emacs
#+END_SRC

*** Building with script

My emacs configuration already shipped an update-to-date version of emacs based on git submodule, if your system can build emacs from source you can use my [[file:scripts/build-emacs.sh]] script to build latested emacs.

#+BEGIN_EXAMPLE
  ./scripts/build-emacs.sh
#+END_EXAMPLE

Note that if your are building under =Mac OSX=, don't forget to install xcode tools:

#+BEGIN_SRC sh :tangle no
  xcode-select --install
#+END_SRC

** Install or testing this config

- First use git to download whole repo

  : git clone https://github.com/coldnew/coldnew-emacs.git

- Then use git submodule to download the spacemacs

  #+BEGIN_EXAMPLE
    git submodule update --init --recursive
  #+END_EXAMPLE

- To generate the =init.el=, jut type

  : make

- If you do not put this repo on =~/.emacs.d=, you need to use following
  command to start emacs

  : emacs -q -l ~/coldnew-emacs/init.el

** Packages need to be installed in system (Optional)

Some extra packages need to be installed in the system manually. These packages are =optional= but can make this configuration work more nicely.

*** Mac OSX

In Mac OSX, I use [[http://brew.sh/][homebrew]] to install opensource packages.

#+BEGIN_SRC sh :tangle no :noweb yes
  #brew install fasd
  #brew install aspell --with-lang-en
  <<install-in-macosx>>
#+END_SRC

*** Gentoo Linux

In Gentoo Linux, don't forget to enable ~USE=emacs~ to make Gentoo auto install emacs-related packages.

#+BEGIN_SRC sh :tangle no :noweb yes
  #emerge app-shells/fasd
  #emerge app-shells/aspell
  <<install-in-gentoo>>
#+END_SRC

*** All platform

Some package like =npm= use the same rule to install in any platform, here list what I need to install.

#+BEGIN_SRC sh :tangle no :noweb yes
  <<install-in-all>>
#+END_SRC

* Early Initialize                                               :init:early:

Since Emacs 27, we can add some setup in =~/.emacs.d/early-init.el= , these setup will be loadded before emacs startup.

#+begin_src emacs-lisp :noweb no-export :exports code :padline no :tangle early-init.el
  ;; early-init.el --- -*- lexical-binding: t; -*-
  <<early-init>>
  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src

** Disable native-compilation for some packages

Adding regexes to `comp-deferred-compilation-deny-list' to make some packages not build by native-compilation when enabled.

Here I just disable native-compile auto loads.  There's something wrong with them.

#+begin_src emacs-lisp :tangle no :noweb-ref early-init
  (with-eval-after-load 'comp
    (setq-default comp-deferred-compilation-deny-list '("\\(?:[^z-a]*-autoloads\\.el$\\)"))
    ;; This variable is obsolete since 29.1
    (setq-default native-comp-deferred-compilation-deny-list '("\\(?:[^z-a]*-autoloads\\.el$\\)"))
    ;; introduce in emacs  28.1
    (setq-default native-comp-jit-compilation-deny-list '("\\(?:[^z-a]*-autoloads\\.el$\\)")))
#+end_src

** Prevent native-compilation warning window popup

native-compilation will asyn report warning or error info, it's so annoying, set it to silent mode so these warning will just logging but not pop up the window.

#+begin_src emacs-lisp :tangle no :noweb-ref early-init
    (with-eval-after-load 'comp
      (setq native-comp-async-report-warnings-errors 'silent))
#+end_src

** Defer garbage collection further back in the startup process

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref early-init
  (setq gc-cons-threshold most-positive-fixnum)
#+END_SRC

** Prevent the glimpse of un-styled Emacs by disabling these UI elements early.

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref early-init
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
#+END_SRC

** Prevent package.el to load packages prior to init.el loading

We plain to handle our package initialization in our configs, we must prevent Emacs from doing it at early stage.

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref early-init
  (setq package-enable-at-startup nil)
#+END_SRC

** Allow loading from the package cache

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref early-init
  (when (>= emacs-major-version 27)
    (setq-default package-quickstart t))
#+END_SRC

** Do not resize the frame at this early stage.

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref early-init
  (setq frame-inhibit-implied-resize t)
#+END_SRC

** Drop 'org-element-at-point' cannot be used in non-Org buffer warning

Not sure why always shows ='org-element-at-point' cannot be used in non-Org buffer= in *Warning* buffer,
follow below link to fix problem

https://github.com/syl20bnr/spacemacs/issues/16575

#+begin_src emacs-lisp  :tangle no :noweb-ref early-init
  (add-to-list 'warning-suppress-types '(org-element org-element-parser))
#+end_src

* Initialize Emacs                                                     :init:

There are some configurations I need to put at the beginning of the emacs config. These configurations are derived from my original init.el file.

** Use lexical binding

For some of my functions, and general coolness, =lexical binding= is a must. Without it, closures cannot be made for example.

This line needs to appear at the beginning of the file to work. Just to keep things looking nice I put it at the beginning of the file.

#+BEGIN_SRC emacs-lisp :padline no
  ;; -*- lexical-binding: t -*-
#+END_SRC
** Make Emacs-26 compatible with Emacs-25

Emacs 26 introduce new =switch= bytecode which not contains in emacs-25, disable it so I can test both emacs-25 and emacs-26.

#+BEGIN_SRC emacs-lisp
  (setq byte-compile-cond-use-jump-table nil)
#+END_SRC

** Use Common Lisp Extension

Some of my function may need the Common Lisp Extension, let's import libraries first.

#+BEGIN_SRC emacs-lisp
  (require 'cl-lib)                       ; built-in
#+END_SRC

** Load extra builtin library

Add some extry buildin library I will use in my config file.

#+BEGIN_SRC emacs-lisp
  (require 'find-lisp)
#+END_SRC

** Prevent load outdated .elc files

Since emacs 24.4, new option =load-prefer-newer= has been introduce, which make me never accidentally using outdated compiled files.

#+BEGIN_SRC emacs-lisp
  (setq load-prefer-newer t)
#+END_SRC

** Setup user-emacs-directory variable                            :variable:

In this configuration, =user-emacs-directory= always refer to the emacs
configuration's init.el parent directory.

#+BEGIN_SRC emacs-lisp
  ;; We set `user-emacs-directory' here so we can use command-line
  ;; switch different emacs configuration like following:
  ;;
  ;;    emacs -q -l ~/coldnew-spacemacs/init.el
  (defconst user-emacs-directory
    (file-name-directory (or load-file-name (buffer-file-name)))
    "My emacs config directory.")
#+END_SRC

** Setup user-cache-directory variable                            :variable:

Setup the cache directory to store some cache content.

#+BEGIN_SRC emacs-lisp
  (defconst user-cache-directory
    (file-name-as-directory (concat user-emacs-directory ".cache"))
    "My emacs storage area for persistent files.")
  ;; create the `user-cache-directory' if not exists
  (make-directory user-cache-directory t)
#+END_SRC
** Setup user-modules-directory variable                         :variable:

Setup the modules directory to store some submodules and extra packages.

#+BEGIN_SRC emacs-lisp
  (defconst user-modules-directory
    (file-name-as-directory (concat user-emacs-directory "modules"))
    "My emacs storage area for modules.")
#+END_SRC

** Setup user-ramdisk-directory variable                          :variable:

I specify a ramdisk path to make my emacs can save som temporary file to it. The ramdisk path should be =~/ramdisk=, if the directory not found, use =/tmp= as fallback.

#+BEGIN_SRC emacs-lisp
  (defconst user-ramdisk-directory
    (let ( (user-ramdisk                   ; ~/ramdisk/
            (concat (getenv "HOME") "/ramdisk/")))
      ;; if ~/ramdisk/ exist, use it
      (if (file-exists-p user-ramdisk)
          user-ramdisk
          ;; fallcack to system default ramdisk dir
          temporary-file-directory))
    "My ramdisk path in system.")
#+END_SRC

** Setup Load path

The variable =load-path= lists all the directories where Emacs should look for emacs-lisp files.

Following are my method to add directories to load-path ~recursively~, this function also create directory to prevent directory not exist.

If you don't have any local elisp and all packages is maintain by cask or elpa or spacemacs, you can skip following code.

#+BEGIN_SRC emacs-lisp
  (eval-and-compile
    ;; Add directories to emacs's `load-path' recursively.
    ;; if path does not exist, try to create directory.
    (let* ((my-lisp-dir
            (list (concat user-emacs-directory "elpa/") ; package installed by package.el
                  (concat user-emacs-directory "local-lisp/") ; local lisp I used
                  (concat user-emacs-directory "styles/"))) ; themes I used
           (sys-lisp-dir (cl-ecase system-type ; add some system site-lisp to load-path
                           ((darwin)    '("/usr/local/share/emacs/site-lisp/"))
                           ((gnu/linux) '("/usr/share/emacs/site-lisp/"))
                           ((t) nil)))  ; FIXME: Add more platform support
           (lisp-dir (append my-lisp-dir sys-lisp-dir)))
      ;; my-lisp-dir should always exist, but sys-lisp-dir may not exist
      (dolist (lisp-path my-lisp-dir)
        (when (not (file-exists-p lisp-path))
          (make-directory lisp-path t)))
      (dolist (lisp-path lisp-dir)
        (when (file-exists-p lisp-path)
          (let* ((default-directory lisp-path))
            (setq load-path
                  (append
                   (let ((load-path (copy-sequence load-path)))
                     (append
                      (copy-sequence (normal-top-level-add-to-load-path '(".")))
                      (normal-top-level-add-subdirs-to-load-path)))
                   load-path)))))))
#+END_SRC

** Under Mac OSX use Command key as ALT

Under Mac OSX, I always bind =Caps lock= as Control key, and make the =Command= key as =ALT= key like I done in Linux.

The =Option= key will be setup as =Super=.

I also disable some keys like =⌘-h= bypass to system in emacs-mac port.

#+BEGIN_SRC emacs-lisp
  (when (eq system-type 'darwin)
    (setq-default mac-option-modifier 'super)
    (setq-default mac-command-modifier 'meta))
#+END_SRC

