init.el
;; -*- lexical-binding: t -*-

(setq byte-compile-cond-use-jump-table nil)

(require 'cl-lib)                       ; built-in

(require 'find-lisp)

(setq load-prefer-newer t)

;; We set `user-emacs-directory' here so we can use command-line
;; switch different emacs configuration like following:
;;
;;    emacs -q -l ~/coldnew-spacemacs/init.el
(defconst user-emacs-directory
  (file-name-directory (or load-file-name (buffer-file-name)))
  "My emacs config directory.")

(defconst user-cache-directory
  (file-name-as-directory (concat user-emacs-directory ".cache"))
  "My emacs storage area for persistent files.")
;; create the `user-cache-directory' if not exists
(make-directory user-cache-directory t)

(defconst user-modules-directory
  (file-name-as-directory (concat user-emacs-directory "modules"))
  "My emacs storage area for modules.")

(defconst user-ramdisk-directory
  (let ( (user-ramdisk                   ; ~/ramdisk/
          (concat (getenv "HOME") "/ramdisk/")))
    ;; if ~/ramdisk/ exist, use it
    (if (file-exists-p user-ramdisk)
        user-ramdisk
        ;; fallcack to system default ramdisk dir
        temporary-file-directory))
  "My ramdisk path in system.")

(eval-and-compile
  ;; Add directories to emacs's `load-path' recursively.
  ;; if path does not exist, try to create directory.
  (let* ((my-lisp-dir
          (list (concat user-emacs-directory "elpa/") ; package installed by package.el
                (concat user-emacs-directory "local-lisp/") ; local lisp I used
                (concat user-emacs-directory "styles/"))) ; themes I used
         (sys-lisp-dir (cl-ecase system-type ; add some system site-lisp to load-path
                         ((darwin)    '("/usr/local/share/emacs/site-lisp/"))
                         ((gnu/linux) '("/usr/share/emacs/site-lisp/"))
                         ((t) nil)))  ; FIXME: Add more platform support
         (lisp-dir (append my-lisp-dir sys-lisp-dir)))
    ;; my-lisp-dir should always exist, but sys-lisp-dir may not exist
    (dolist (lisp-path my-lisp-dir)
      (when (not (file-exists-p lisp-path))
        (make-directory lisp-path t)))
    (dolist (lisp-path lisp-dir)
      (when (file-exists-p lisp-path)
        (let* ((default-directory lisp-path))
          (setq load-path
                (append
                 (let ((load-path (copy-sequence load-path)))
                   (append
                    (copy-sequence (normal-top-level-add-to-load-path '(".")))
                    (normal-top-level-add-subdirs-to-load-path)))
                 load-path)))))))

(when (eq system-type 'darwin)
  (setq-default mac-option-modifier 'super)
  (setq-default mac-command-modifier 'meta))
