init.org
** Save custom-file as cache

Most of my config is written in this file, it's no need to tracking the emacs's custom-setting.

I move the file to cache-dir and make git ignore it.

#+BEGIN_SRC emacs-lisp
  (setq-default custom-file (concat user-cache-directory "custom.el"))
  ;; load custom-file only when file exist
  (when (file-exists-p custom-file)
    (load-file custom-file))
#+END_SRC
** Loading Modules

I think I'll write some dynamic module extension, which will save to =~/.emacs.d/modules=, use a helper script to help me load them.

#+BEGIN_SRC emacs-lisp
  ;; load the `load-modules.el' file which help me load external modulept
  (let ((script (concat user-modules-directory "load-modules.el")))
    (when (file-exists-p script)
      (load script)))
#+END_SRC

** Startup emacs server

Only start server mode if I'm not root

#+BEGIN_SRC emacs-lisp
  (unless (string-equal "root" (getenv "USER"))
    (require 'server)
    (when (fboundp 'server-running-p)
      (unless (server-running-p) (server-start))))
#+END_SRC

** Setup backup files

By default Emacs saves =BackupFiles= under the original name with a tilde =~= appended. Example: Editing README will result in README and README~ in the same directory.

This is primitive and boring.

I save my backup files to =~/.emacs.d/.cache/backup= and since is always ignore by version control system, it's a nice place to store backup files.

#+BEGIN_SRC emacs-lisp
  (let ((backup-dir (concat user-cache-directory "backup")))
    ;; Move backup file to `~/.emacs.d/.cache/backup'
    (setq backup-directory-alist `(("." . ,backup-dir)))
    ;; Makesure backup directory exist
    (when (not (file-exists-p backup-dir))
      (make-directory backup-dir t)))
#+END_SRC

Also setup some backup settings.

#+BEGIN_SRC emacs-lisp
  (setq delete-by-moving-to-trash nil)
  (setq version-control t)
  (setq kept-old-versions 10)
  (setq kept-new-versions 20)
  (setq delete-old-versions t)
  (setq backup-by-copying t)
#+END_SRC

** Disable some default stuff

Some emacs feature is not really useful

*** Turn-off Alarm Bell

#+BEGIN_SRC emacs-lisp
  (setq ring-bell-function #'ignore)
#+END_SRC

*** Clean scratch buffer messages

Leave me a clean **scratch** buffer and I'll be more happy :)

#+BEGIN_SRC emacs-lisp
  (setq initial-scratch-message "")
#+END_SRC

*** Use visible bell instead of buzzer

#+BEGIN_SRC emacs-lisp
  (setq visible-bell t)
#+END_SRC

*** Ask for y or n, not yes or no

Emacs starts out asking for you to type yes or no with most important questions.
Just let me use =y= or =n= with no =RET= required an I'm quite happy.

#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

** Maximized window after emacs start

#+BEGIN_SRC emacs-lisp
  (modify-all-frames-parameters '((fullscreen . maximized)))
#+END_SRC

* Personal Information                                              :personal:

It's useful to have some basic personal information.

#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Yen-Chin, Lee")
  (setq user-mail-address "coldnew.tw@gmail.com")
#+END_SRC

Some of my password stored in a secret file with gnupg encrypt, I add this function here so I can inject some emacs-command which hass password/account setting.

#+BEGIN_SRC emacs-lisp
  (defun my-load-secret ()
    "Load my secret setting include password... etc."
    (let ((secret "~/.secret.el.gpg"))
      (when (file-exists-p secret) (load-file secret))))
#+END_SRC

* Package Management

The main package manager I use is emacs's =package.el=, it's really nice and easy to use.

** Add my extra package list

[[http://melpa.org][melpa]] contains many community packages that not contribute to emacs's elpa, we add it here.

#+BEGIN_SRC emacs-lisp
  (eval-and-compile
    (require 'package)			; built-in

    ;; melpa
    (add-to-list 'package-archives
                 '("melpa" . "https://melpa.org/packages/") t)

    ;; For important compatibility libraries like cl-lib
    (when (< emacs-major-version 24)
      (add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/"))))
#+END_SRC

** Initialize package.el

Before we start to use =package.el=, we need to initialize it first.

#+BEGIN_SRC emacs-lisp
  ;; This must come before configurations of installed packages.
  ;; Don't delete this line. If you don't want it, just comment it out by adding a
  ;; semicolon to the start of the line. You may delete these explanatory
  ;; comments.
  (eval-and-compile
    (when (< emacs-major-version 27)
      (package-initialize)))
#+END_SRC

** Install use-package

The =use-package= macro allows you to isolate package configuration in your =.emacs= file in a way that is both performance-oriented and, well, tidy. I created it
because I have over 80 packages that I use in Emacs, and things were getting difficult to manage. Yet with this utility my total load time is around 2 seconds, with no loss of functionality!

GitHub: https://github.com/jwiegley/use-package

NOTE:

=use-package= is integrated in emacs directly since emacs 29.1, it's no need to install it manually anymore.

#+BEGIN_SRC emacs-lisp
  (eval-and-compile
    (unless (package-installed-p 'use-package)
      (package-refresh-contents)
      (package-install 'use-package))) ; Installed by packages.el
#+END_SRC

use-package now can only need once, just add it to compile time

#+BEGIN_SRC emacs-lisp
  (eval-when-compile (require 'use-package))
#+END_SRC

You can setup =use-package-always-ensure= variable to =t= if you want to make =use-package= auto install packages.

However, since we need to initialize =spacemacs= first, we need to setup this variable after spacemacs init.

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref spacemacs-later-init
  ;; make `use-package' auto install non-installed packages.
  (when (require 'use-package-ensure)
    (setq use-package-always-ensure t))
#+END_SRC

Report details about loading and configuration.

#+BEGIN_SRC emacs-lisp
  (setq use-package-verbose t)
#+END_SRC

** Install straight

straight.el is next-generation, purely functional package manager for the Emacs hacker.
It can integrated with [[https://github.com/jwiegley/use-package][use-package]] and install some packages from fork.

GitHub: https://github.com/raxod502/straight.el

#+BEGIN_SRC emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+END_SRC

** Install paradox

Project for modernizing Emacs' Package Menu. With improved appearance, mode-line information. Github integration, customizability, asynchronous upgrading, and more.

GitHub: https://github.com/Malabarba/paradox

#+BEGIN_SRC emacs-lisp
  (use-package paradox
    :ensure t
    :commands (paradox-enable)
    :hook (after-init . paradox-enable)
    :init
    (setq paradox-execute-asynchronously t
          paradox-spinner-type 'progress-bar
          paradox-github-token t
          paradox-display-star-count nil))
#+END_SRC

** Install some common libraries

Some common libraries I'll use in my personal's command or anything else.

#+BEGIN_SRC emacs-lisp
  (use-package f :ensure t)
  (use-package s :ensure t)
  (use-package dash :ensure t)
  (use-package htmlize :ensure t)
  (use-package async :ensure t)
#+END_SRC

* Languages and Encodings

Add UTF8 at the front of the priority list for automatic detection.

#+BEGIN_SRC emacs-lisp
  (prefer-coding-system 'utf-8)
#+END_SRC

Set up multilingual environment to use UTF-8.

#+BEGIN_SRC emacs-lisp
  (set-language-environment "UTF-8")
#+END_SRC

Set default value of various coding systems to UTF-8.

#+BEGIN_SRC emacs-lisp
  (set-default-coding-systems 'utf-8)
#+END_SRC

Use =C= as locale for display time info (Actually it will display English).

#+BEGIN_SRC emacs-lisp
  (setq system-time-locale "C")
#+END_SRC

* Built-in Packages

Some buildin packages need to add extra setups for my emacs setting.

Most of them are the cache file, I'll move them to =~/.emacs.d/.cache= directory.

** abbrev

#+BEGIN_SRC emacs-lisp
  (eval-after-load 'bookmark
    '(progn
       (setq abbrev-file-name
             (concat user-cache-directory "abbrev_defs"))))
#+END_SRC

** eshell

Move eshell cache dir to =~/.emacs.d/.cache/eshell=

#+BEGIN_SRC emacs-lisp
  (eval-when-compile (defvar eshell-directory-name)) ; defined in esh-mode.el

  (with-eval-after-load 'esh-mode
    (setq-default eshell-directory-name
                  (concat user-cache-directory "eshell")))

  (with-eval-after-load 'em-hist
    (setq-default eshell-history-file-name
                  (expand-file-name "history" eshell-directory-name)))
#+END_SRC

** bookmark

#+BEGIN_SRC emacs-lisp
  (eval-after-load 'bookmark
    '(progn
       (setq-default bookmark-default-file
                     (concat user-cache-directory "bookmarks"))))
#+END_SRC

** idlwave

Major mode for editing IDL source files.

#+BEGIN_SRC emacs-lisp
  (eval-after-load 'idlwave
    '(progn
       (setq-default idlwave-config-directory
             (concat user-cache-directory "idlwave"))))
#+END_SRC

** srecode

#+BEGIN_SRC emacs-lisp
  ;; change srecode cache file path
  (eval-after-load 'srecode
    '(progn
       (setq-default srecode-map-save-file
                     (concat user-cache-directory "srecode-map.el"))))
#+END_SRC

** request

#+BEGIN_SRC emacs-lisp
  (eval-after-load 'request
    '(progn
       (setq-default request-storage-directory
                     (concat user-cache-directory "request"))))
#+END_SRC

** nsm

#+BEGIN_SRC emacs-lisp
  (eval-after-load 'nsm
    '(progn
       (setq-default nsm-settings-file
                     (concat user-cache-directory "network-security.data"))))
#+END_SRC

** url

#+BEGIN_SRC emacs-lisp
  (eval-after-load 'url
    '(progn
       (setq url-configuration-directory
             (file-name-as-directory
              (concat user-cache-directory "url")))))
#+END_SRC

