init.el

(setq-default custom-file (concat user-cache-directory "custom.el"))
;; load custom-file only when file exist
(when (file-exists-p custom-file)
  (load-file custom-file))

;; load the `load-modules.el' file which help me load external modulept
(let ((script (concat user-modules-directory "load-modules.el")))
  (when (file-exists-p script)
    (load script)))

(unless (string-equal "root" (getenv "USER"))
  (require 'server)
  (when (fboundp 'server-running-p)
    (unless (server-running-p) (server-start))))

(let ((backup-dir (concat user-cache-directory "backup")))
  ;; Move backup file to `~/.emacs.d/.cache/backup'
  (setq backup-directory-alist `(("." . ,backup-dir)))
  ;; Makesure backup directory exist
  (when (not (file-exists-p backup-dir))
    (make-directory backup-dir t)))

(setq delete-by-moving-to-trash nil)
(setq version-control t)
(setq kept-old-versions 10)
(setq kept-new-versions 20)
(setq delete-old-versions t)
(setq backup-by-copying t)

(setq ring-bell-function #'ignore)

(setq initial-scratch-message "")

(setq visible-bell t)

(defalias 'yes-or-no-p 'y-or-n-p)

(modify-all-frames-parameters '((fullscreen . maximized)))

(setq user-full-name "Yen-Chin, Lee")
(setq user-mail-address "coldnew.tw@gmail.com")

(defun my-load-secret ()
  "Load my secret setting include password... etc."
  (let ((secret "~/.secret.el.gpg"))
    (when (file-exists-p secret) (load-file secret))))

(eval-and-compile
  (require 'package)			; built-in

  ;; melpa
  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/") t)

  ;; For important compatibility libraries like cl-lib
  (when (< emacs-major-version 24)
    (add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/"))))

;; This must come before configurations of installed packages.
;; Don't delete this line. If you don't want it, just comment it out by adding a
;; semicolon to the start of the line. You may delete these explanatory
;; comments.
(eval-and-compile
  (when (< emacs-major-version 27)
    (package-initialize)))

(eval-and-compile
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))) ; Installed by packages.el

(eval-when-compile (require 'use-package))

(setq use-package-verbose t)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(use-package paradox
  :ensure t
  :commands (paradox-enable)
  :hook (after-init . paradox-enable)
  :init
  (setq paradox-execute-asynchronously t
        paradox-spinner-type 'progress-bar
        paradox-github-token t
        paradox-display-star-count nil))

(use-package f :ensure t)
(use-package s :ensure t)
(use-package dash :ensure t)
(use-package htmlize :ensure t)
(use-package async :ensure t)

(prefer-coding-system 'utf-8)

(set-language-environment "UTF-8")

(set-default-coding-systems 'utf-8)

(setq system-time-locale "C")

(eval-after-load 'bookmark
  '(progn
     (setq abbrev-file-name
           (concat user-cache-directory "abbrev_defs"))))

(eval-when-compile (defvar eshell-directory-name)) ; defined in esh-mode.el

(with-eval-after-load 'esh-mode
  (setq-default eshell-directory-name
                (concat user-cache-directory "eshell")))

(with-eval-after-load 'em-hist
  (setq-default eshell-history-file-name
                (expand-file-name "history" eshell-directory-name)))

(eval-after-load 'bookmark
  '(progn
     (setq-default bookmark-default-file
                   (concat user-cache-directory "bookmarks"))))

(eval-after-load 'idlwave
  '(progn
     (setq-default idlwave-config-directory
           (concat user-cache-directory "idlwave"))))

;; change srecode cache file path
(eval-after-load 'srecode
  '(progn
     (setq-default srecode-map-save-file
                   (concat user-cache-directory "srecode-map.el"))))

(eval-after-load 'request
  '(progn
     (setq-default request-storage-directory
                   (concat user-cache-directory "request"))))

(eval-after-load 'nsm
  '(progn
     (setq-default nsm-settings-file
                   (concat user-cache-directory "network-security.data"))))

(eval-after-load 'url
  '(progn
     (setq url-configuration-directory
           (file-name-as-directory
            (concat user-cache-directory "url")))))

;; NOTE:
