init.el
;; `auto-save-list-file-prefix' defined in startup.el, but
;; startup.el doesn't have provide pacage name (provide 'startup)
;;
(setq-default auto-save-list-file-prefix
              (cond ((eq system-type 'ms-dos)
                     ;; MS-DOS cannot have initial dot, and allows only 8.3 names
                     (file-name-as-directory
                      (concat user-cache-directory "auto-save.list/_saves-")))
                    (t
                     (file-name-as-directory
                      (concat user-cache-directory "auto-save-list/.saves-")))))

(use-package discover-my-major
  :defer 2	      ; Install pkg if not exist after 2 sec idle time
  :commands (discover-my-major))

(when (require 'doxymacs nil 'noerror)
  (add-hook 'prog-mode-hook #'(lambda () (doxymacs-mode))))

(use-package esup
  :ensure t
  :commands (esup)
  :init
  ;; Work around a bug where esup tries to step into the byte-compiled
  ;; version of `cl-lib', and fails horribly.
  ;; see:
  ;; https://github.com/jschaf/esup/issues/54#issuecomment-651247749
  (setq esup-depth 0))

(use-package exec-path-from-shell
  :ensure t
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))

(use-package expand-region
  :ensure t
  :bind (("M-v" . er/expand-region)))

(use-package fancy-narrow :ensure t)

(use-package focus :ensure t)

(use-package fontawesome :ensure t)

(use-package google-translate :ensure t)

(use-package goto-last-change
  :ensure t)

(use-package howdoi
  :defer 2
  :commands (howdoi-query howdoi-query-line-at-point))

(use-package hungry-delete
  :ensure t
  :config
  (global-hungry-delete-mode))

(use-package iedit
  :ensure t
  :bind (("C-;" . iedit-mode)))

(use-package manage-minor-mode :ensure t)

(use-package mwim
  :ensure t
  :bind
  (("C-a" . mwim-beginning-of-code-or-line)
   ("C-e" . mwim-end-of-code-or-line)))

(use-package pangu-spacing
  :ensure t
  :commands (global-pangu-spacing-mode)
  :config
  ;; start pangu-spacing globally
  (global-pangu-spacing-mode 1)
  ;; Always insert `real' space in org-mode.
  (add-hook 'org-mode-hook
            (lambda ()
              (set (make-local-variable 'pangu-spacing-real-insert-separtor) t))))

(use-package password-generator :ensure t)

(use-package rainbow-mode :ensure t)

(use-package smartparens
  :ensure t
  :commands (smartparens-mode)
  :config
  (smartparens-mode 1))

(use-package sx :ensure t)

(use-package tldr
  :defer 2
  :commands (tldr)
  :config
  (setq tldr-directory-path (concat user-cache-directory "tldr/"))
  (setq tldr-saved-zip-path (concat user-cache-directory "tldr-source.zip")))

(use-package url-shortener :ensure t)

(use-package verify-url
  :defer 2
  :commands (verify-url))

(use-package visual-regexp :ensure t)

(use-package webpaste
  :ensure t)
