init.org
*** Clone current file to new one

#+BEGIN_SRC emacs-lisp
  (defun my/clone-file-and-open (filename)
    "Clone the current buffer writing it into FILENAME and open it"
    (interactive "FClone to file: ")
    (save-restriction
      (widen)
      (write-region (point-min) (point-max) filename nil nil nil 'confirm))
    (find-file filename))
#+END_SRC

*** Show current buffer-file information

#+BEGIN_SRC emacs-lisp
  (defun my/file-info ()
    "Show current buffer information."
    (interactive)
    (if (buffer-file-name (current-buffer))
        (progn
          (let* ((file-name (buffer-file-name (current-buffer)))
                 (f-attr (file-attributes file-name))
                 (f-size (nth 7 f-attr))  ; ファイルサイズ
                 (f-mode (nth 8 f-attr))  ; ファイル属性
                 (mes1 (format "file path: %s\n" file-name))
                 (mes2 (format "file size: %s byte\n" f-size))
                 (mes3 (format "file type: %s" f-mode))
                 (mess (concat mes1 mes2 mes3)))
            (message "%s" mess)))
      nil))
#+END_SRC

** Debug                                                             :debug:

*** Eval emacs buffer until error

A really nice command help me to find error on elisp buffer.

#+BEGIN_SRC emacs-lisp
  (defun my/eval-buffer-until-error ()
    "Evaluate emacs buffer until error occured."
    (interactive)
    (goto-char (point-min))
    (while t (eval (read (current-buffer)))))
#+END_SRC

*** Display face found at the current point

#+BEGIN_SRC emacs-lisp
  (defun my/what-face (pos)
    "Display face found at the current point."
    (interactive "d")
    (let ((face (or (get-char-property (point) 'read-face-name)
                    (get-char-property (point) 'face))))
      (if face (message "Face: %s" face) (message "No face at %d" pos))))
#+END_SRC

*** Reload emacs init config

#+BEGIN_SRC emacs-lisp
  (defun my/reload-init ()
    "Reload init.el file"
    (interactive)
    (load-file user-init-file))
#+END_SRC

** Window                                                           :window:

*** Switch to other window or split it

If other window does not exist, split it, else switch to it.

#+BEGIN_SRC emacs-lisp
  (defun my/other-window-or-split ()
    "Switch to other window or split it."
    (interactive)
    (when (one-window-p)
      (split-window-horizontally))
    (other-window 1))
#+END_SRC

*** Swap left/right windows

If I have two windows at left/right position, this command can help me change left-window to right-window.

#+BEGIN_SRC emacs-lisp
  (defun my/swap-window-positions ()
    "*Swap the positions of this window and the next one."
    (interactive)
    (let ((other-window (next-window (selected-window) 'no-minibuf)))
      (let ((other-window-buffer (window-buffer other-window))
            (other-window-hscroll (window-hscroll other-window))
            (other-window-point (window-point other-window))
            (other-window-start (window-start other-window)))
        (set-window-buffer other-window (current-buffer))
        (set-window-hscroll other-window (window-hscroll (selected-window)))
        (set-window-point other-window (point))
        (set-window-start other-window (window-start (selected-window)))
        (set-window-buffer (selected-window) other-window-buffer)
        (set-window-hscroll (selected-window) other-window-hscroll)
        (set-window-point (selected-window) other-window-point)
        (set-window-start (selected-window) other-window-start))
      (select-window other-window)))
#+END_SRC

* Styles                                                              :style:

My own emacs, my own style :)

** General Setups

Some emacs's default UI feature setup.

*** Turn-off menu bar

The menu bar is one of the UI elements which work best with mouses.

#+BEGIN_SRC emacs-lisp
  (when (featurep 'menu-bar) (menu-bar-mode -1))
#+END_SRC

*** Turn-off tool bar

I never use the tool bar, it's really no need.

#+BEGIN_SRC emacs-lisp
  (when (featurep 'tool-bar) (tool-bar-mode -1))
#+END_SRC

*** Turn-off blinking cursor

I hate the blinking cursor actually, it's really annoying.

#+BEGIN_SRC emacs-lisp
  (blink-cursor-mode -1)
#+END_SRC

*** Turn-off scroll bar

Actually when you familier with emacs, you don't need to use scroll-bar anymore.

#+BEGIN_SRC emacs-lisp
  (when (featurep 'scroll-bar) (scroll-bar-mode -1))
#+END_SRC

*** Turn-off startup screen

I don't want to enter the startup screen after initialize emacs.

#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-screen t)
#+END_SRC

** Theme

Before use emacs's =load-theme= function, I advise it to make it fully unload previous theme before loading a new one.

#+BEGIN_SRC emacs-lisp
  ;; Make `load-theme' fully unload previous theme before loading a new one.
  (defadvice load-theme
      (before theme-dont-propagate activate)
    (mapc #'disable-theme custom-enabled-themes))
#+END_SRC

I always want to customize everything on my own, so I build my own emacs theme called =night-coldnew= and =day-coldnew=, you can find
them at styles dir.

- [[file:styles/coldnew-theme.el]]

  Basic utils and macros to define coldnew-theme.

- [[file:styles/day-coldnew-theme.el]]

  My day theme.

- [[file:styles/night-coldnew-theme.el]]

  My night theme.

#+BEGIN_SRC emacs-lisp
  (require 'day-coldnew-theme)
  (require 'night-coldnew-theme)
  (load-theme 'night-coldnew t nil)  ; default use `night-coldnew-theme'
#+END_SRC
* TODO Fonts

#+BEGIN_SRC emacs-lisp
  (defvar my/emacs-english-font "Monaco"
    "The font name of English.")

  (defvar my/emacs-cjk-font "Hiragino Sans GB"
    "The font name for CJK.")

  (defvar my/emacs-font-size-pair '(13 . 16)
    "Default font size pair for (english . chinese)")

  (defun my/font-exist-p (fontname)
    "Test if this font is exist or not.
  This function only work on GUI mode, on terminal it just
  return nil since you can't set font for emacs on it."
    (if (or (not fontname) (string= fontname "") (not (display-graphic-p)))
        nil
      (if (not (x-list-fonts fontname))
          nil t)))

  (defun my/set-font (english chinese size-pair)
    "Setup emacs English and Chinese font on x window-system."

    (if (my/font-exist-p english)
        (set-frame-font (format "%s:pixelsize=%d" english (car size-pair)) t))

    (if (my/font-exist-p chinese)
        (dolist (charset '(kana han cjk-misc bopomofo))
          (set-fontset-font (frame-parameter nil 'font) charset
                            (font-spec :family chinese :size (cdr size-pair))))))

  ;; Setup font size based on my/emacs-font-size-pair
  (my/set-font my/emacs-english-font my/emacs-cjk-font my/emacs-font-size-pair)

  (defvar my/emacs-font-size-pair-list
    '(( 5 .  6) (10 . 12)
      (13 . 16) (15 . 18) (17 . 20)
      (19 . 22) (20 . 24) (21 . 26)
      (24 . 28) (26 . 32) (28 . 34)
      (30 . 36) (34 . 40) (36 . 44))
    "This list is used to store matching (english . chinese) font-size.")

  (defun my/emacs-step-font-size (step)
    "Increase/Decrease emacs's font size."
    (let ((scale-steps my/emacs-font-size-pair-list))
      (if (< step 0) (setq scale-steps (reverse scale-steps)))
      (setq my/emacs-font-size-pair
            (or (cadr (member my/emacs-font-size-pair scale-steps))
                my/emacs-font-size-pair))
      (when my/emacs-font-size-pair
        (message "emacs font size set to %.1f" (car my/emacs-font-size-pair))
        (my/set-font my/emacs-english-font my/emacs-cjk-font my/emacs-font-size-pair))))

  (defun my/increase-emacs-font-size ()
    "Decrease emacs's font-size acording emacs-font-size-pair-list."
    (interactive) (my/emacs-step-font-size 1))

  (defun my/decrease-emacs-font-size ()
    "Increase emacs's font-size acording emacs-font-size-pair-list."
    (interactive) (my/emacs-step-font-size -1))
#+END_SRC

** Setup Keybinds                                               :keybinding:

#+BEGIN_SRC emacs-lisp
  (bind-keys :map global-map
             ("C-=" . my/increase-emacs-font-size)
             ("C--" . my/decrease-emacs-font-size))
#+END_SRC


* Minibuffer                                                :minibuffer:

#+BEGIN_SRC emacs-lisp :noweb no-export :exports code
  (when (require 'minibuffer)                  ; buildin
    <<minibuffer-config>>)
#+END_SRC

** Make cursor in minibufer use bar shape

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref minibuffer-config
  ;; only use `bar' type of cursor shape
  (add-hook 'minibuffer-setup-hook #'(lambda () (setq cursor-type 'bar)))
#+END_SRC

** Some helper function to let me insert quick in minibuffer

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref minibuffer-config
  ;; define some helper function to insert to minibuffer quickly
  (defun my/minibuffer-insert (p)
    (kill-line 0) (insert p))

  (defun my/minibuffer-switch-to-ramdisk ()
    "Insert ramdisk path according to system type"
    (interactive)
    (my/minibuffer-insert user-ramdisk-directory))

  (defun my/minibuffer-switch-to-home ()
    "Insert $HOME path."
    (interactive)
    (my/minibuffer-insert (file-name-as-directory (getenv "HOME"))))

  (defun my/minibuffer-switch-to-rootdir ()
    "Insert / path."
    (interactive)
    (my/minibuffer-insert "/"))

  (defun my/minibuffer-switch-to-tramp ()
    "Insert /ssh:."
    (interactive)
    (my/minibuffer-insert "/ssh:"))
#+END_SRC

