init.org
** Remote file editing

#+BEGIN_SRC emacs-lisp
  (use-package tramp
    :ensure t
    :init
    (setq tramp-persistency-file-name (concat user-cache-directory "tramp"))
    :config
    (setq tramp-default-method "rsync"))
#+END_SRC

** Line Numbers

In most case, I'll make line numers display globally by =linum=.

#+BEGIN_SRC emacs-lisp
  (if (version<= "26.1" emacs-version)
      ;; emacs 26.1 has display-line-number-mode, which is written in C
      (progn
        (require 'display-line-numbers)
        ;; Only use line number in `prog-mode-hook'
        (add-hook 'prog-mode-hook #'display-line-numbers-mode))
      ;; for emacs version less than 26, use linum instead
      (use-package linum :ensure t :init (global-linum-mode 1)))
#+END_SRC

Disable line number in some mode, for example, since =org-mode= can
has many lines, it's not recommand to enable linum-mode.

I use =linum-off= to disable some mode.

#+BEGIN_SRC emacs-lisp
  ;; disble some mode with linum
  (use-package linum-off
    :ensure t
    :config
    (setq linum-disabled-mode-list
          '(eshell-mode shell-mode term-mode erc-mode compilation-mode
                        woman-mode w3m-mode calendar-mode org-mode)))

  ;; for emacs 26.1 or above, we use `display-line-number-mode' instead
  (when (version<= "26.1" emacs-version)
    ;; NOTE: overwrite display-line-numbers--turn-on
    (defun display-line-numbers--turn-on ()
      "Turn on `display-line-numbers-mode'."
      (unless (or (minibufferp)
                  ;; taken from linum.el
                  (and (daemonp) (null (frame-parameter nil 'client)))
                  ;; take code from `linum-off'
                  (member major-mode linum-disabled-modes-list))
        (display-line-numbers-mode))))
#+END_SRC

** Colorfy delimters

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is a "rainbow parentheses"-like mode which
highlights delimiters such as parentheses, brackets or braces
according to their depth. Each successive level is highlighted in a
different color. This makes it easy to spot matching delimiters,
orient yourself in the code, and tell which statements are at a given
depth.

#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :config
    (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
#+END_SRC

** Save recent file info                                           :recentf:

#+BEGIN_SRC emacs-lisp
  (use-package recentf
    :straight (:type built-in)
    :init (setq recentf-save-file (expand-file-name "recentf" user-cache-directory))
    :config
    (recentf-mode 1))
#+END_SRC

** Highlight numbers

=highlight-numbers= is an Emacs minor mode that highlights numeric literals in
source code.

GitHub: https://github.com/Fanael/highlight-numbers

#+BEGIN_SRC emacs-lisp
  (use-package highlight-numbers
    :ensure t
    :config
    ;; json-mode has it's own highlight numbers method
    (add-hook 'prog-mode-hook #'(lambda()
                                 (if (not (derived-mode-p 'json-mode))
                                     (highlight-numbers-mode)))))
#+END_SRC

** Highlight escape charset

GitHub: https://github.com/dgutov/highlight-escape-sequences

#+BEGIN_SRC emacs-lisp
  (use-package highlight-escape-sequences
    :ensure t
    :config
    ;; Make face the same as builtin face
    (put 'font-lock-regexp-grouping-backslash 'face-alias 'font-lock-builtin-face)
    ;; Enable globally
    (hes-mode 1))
#+END_SRC

** Highlight FIXME, TODO

#+begin_src emacs-lisp
  (defun font-lock-comment-annotations ()
    "Highlight a bunch of well known comment annotations.
  This functions should be added to the hooks of major modes for programming."
    (font-lock-add-keywords
     nil
     '(("\\<\\(FIX\\(ME\\)?\\|BUG\\|HACK\\):" 1 font-lock-warning-face t)
       ("\\<\\(NOTE\\):" 1 'org-level-2 t)
       ("\\<\\(TODO\\):" 1 'org-todo t)
       ("\\<\\(DONE\\):" 1 'org-done t))
     ))

  (add-hook 'prog-mode-hook 'font-lock-comment-annotations)
#+end_src

** Show vertical lines to guide indentation

GitHub: https://github.com/zk-phi/indent-guide

#+BEGIN_SRC emacs-lisp
  (use-package indent-guide
    :ensure t
    :config
    ;; Only show indent-guide in idle-time.
    (setq indent-guide-delay 0.1))
#+END_SRC

** Visualization of matching parens

#+BEGIN_SRC emacs-lisp
  (show-paren-mode 1)
  (setq show-paren-delay 0)               ; no delay
#+END_SRC

** Adapt to foreign indentation offsets

An Emacs minor mode that guesses the indentation offset originally
used for creating source code files and transparently adjusts the
corresponding settings in Emacs, making it more convenient to edit
foreign files.

GitHub: https://github.com/jscheid/dtrt-indent

#+BEGIN_SRC emacs-lisp
  (use-package dtrt-indent
    :ensure t
    :config
    ;; enable dtrt-indent-mode globally
    (dtrt-indent-mode 1))
#+END_SRC

** Intelligently call whitespace-cleanup on save

This Emacs library minor mode will intelligently call =whitespace-cleanup= before
buffers are saved.

=whitespace-cleanup= is a handy function, but putting it in =before-save-hook=
for every buffer is overkill, and causes messy diffs when editing third-party
code that did not initially have clean whitespace.

Additionally, whitespace preferences are often project-specific, and it's
inconvenient to set up =before-save-hook= in a =.dir-locals.el= file.

=whitespace-cleanup-mode= is a minor mode which calls =whitespace-cleanup=
before saving the current buffer, but only if the whitespace in the buffer was
initially clean. It determines this by quickly checking to see if
=whitespace-cleanup= would have any effect on the buffer.

GitHub: https://github.com/purcell/whitespace-cleanup-mode

#+BEGIN_SRC emacs-lisp
  (use-package whitespace-cleanup-mode
    :ensure t
    :config
    (add-hook 'prog-mode-hook 'whitespace-cleanup-mode))
#+END_SRC

** Make Firefox can call Emacs to edit textarea

Want to edit Firefox's textarea in emacs ?

First, you need to install [[https://addons.mozilla.org/zh-TW/firefox/addon/edit-with-emacs1][Edit with Emacs]] on Firefox.

Then, in emacs, add following code to install

#+BEGIN_SRC emacs-lisp
  (use-package edit-server
    :ensure t
    :config
    (edit-server-start))
#+END_SRC

** Setup TABS

#+BEGIN_SRC emacs-lisp
  (setq tab-always-indent 'complete)
#+END_SRC

** Highlight symbols with overlay

#+BEGIN_SRC emacs-lisp
  (use-package symbol-overlay
    :ensure t
    :config
    (add-hook 'prog-mode-hook #'symbol-overlay-mode)
    ;; (global-set-key (kbd "M-i") 'symbol-overlay-put)
    (define-key symbol-overlay-map (kbd "p") 'symbol-overlay-jump-prev) ;; 次のシンボルへ
    (define-key symbol-overlay-map (kbd "n") 'symbol-overlay-jump-next) ;; 前のシンボルへ
    (define-key symbol-overlay-map (kbd "C-g") 'symbol-overlay-remove-all) ;; ハイライトキャンセル
    )
#+END_SRC

** TODO Scrolling

ref:
https://www.reddit.com/r/emacs/comments/8sw3r0/finally_scrolling_over_large_images_with_pixel/

#+BEGIN_SRC emacs-lisp
  (setq mouse-wheel-scroll-amount '(1)) ; Distance in pixel-resolution to scroll each mouse wheel event.
  (setq mouse-wheel-progressive-speed nil) ; Progressive speed is too fast for me.
#+END_SRC

** Undo with undo-tree                                                :undo:

Standard Emacs undo is kind of confusing. [[http://www.dr-qubit.org/emacs.php#undo-tree][undo-tree]] replaces this with a simpler tree structure. It also allows us to visualize the tree directly.

GitHub: https://github.com/emacsmirror/undo-tree

#+BEGIN_SRC emacs-lisp
  (use-package undo-tree
    :ensure t
    :commands (global-undo-tree-mode)
    :config
    ;; Persistent undo-tree history across emacs sessions
    (let ((dir
           (file-name-as-directory (concat user-cache-directory "undo-tree"))))
      (setq undo-tree-history-directory-alist `(("." . ,dir))))
    ;; Make undo-tree save history
    (setq undo-tree-auto-save-history t)
    ;; global enable undo-tree
    (global-undo-tree-mode))
#+END_SRC

* Buffer                                                             :buffer:
** Create *scratch* automatically

Sometimes I'll clean the =*scratch*= buffer by kill it, add following function
to let emacs re-create it automatically.

#+BEGIN_SRC emacs-lisp
  ;; Create *scratch* automatically
  (run-with-idle-timer 1 t
                       #'(lambda ()
                          (unless (get-buffer "*scratch*")
                            (with-current-buffer (get-buffer-create "*scratch*")
                              (lisp-interaction-mode)))))
#+END_SRC

** Make buffer names unique

The library uniquify overrides Emacs' default mechanism for making buffer names unique (using suffixes like <2>, <3> etc.) with a more sensible behaviour which use parts of the file names to make the buffer names distinguishable.

For instance, buffers visiting =/tmp/Makefile= and =/projects/coldnew/Makefile= would be named =Makefile|tmp= and =Makefile|coldnew=, respectively (instead of =Makefile= and =Makefile<2>=).

#+BEGIN_SRC emacs-lisp
  (use-package uniquify
    :ensure nil                           ; built-in
    :config
    ;; starting separator for buffer name components
    (setq uniquify-separator " • ")
    ;; rerationalize buffer names after a buffer has been killed.
    (setq uniquify-after-kill-buffer-p t)
    ;; ignore non file buffers
    (setq uniquify-ignore-buffers-re "^\\*"))
#+END_SRC
* Bookmarks

** Set up default registers

In emacs, there's a =jump-to-register (C-x r j)= command which can quickly switch to the file you setup.

For more info, you can refer to: [[https://www.emacswiki.org/emacs/Registers][EmacsWiki: Registers]]

#+BEGIN_SRC emacs-lisp
  (dolist
      (r `(
	   ;; emacs's config.org
	   (?e (file . "~/.emacs.d/init.org"))
	   ;; tasks: todo
	   (?t (file . "~/Org/tasks/todo.org"))
	   ;; tasks: personal
	   (?p (file . "~/Org/tasks/personal.org"))
	   ;; tasks: work
	   (?w (file . "~/Org/tasks/work.org"))
	   ;; Offilce docs
	   (?W (file . "~/Org/Weintek/index.org"))
	   ;; My personal note
	   (?n (file . "~/Org/Note.org"))
	   ;; blogging ideas
	   (?b (file . "~/Org/blog.org"))
	   ;; Finance
	   (?f (file . "~/Org/finance/personal.org"))
	   ))
    (set-register (car r) (cadr r)))
#+END_SRC

** Setup Keybinding                                             :keybinding:

#+BEGIN_SRC emacs-lisp
    (bind-keys :map my-editor-map
               ;("C-x n" . bm-next)
               ;("C-x p" . bm-previous)
               ;("C-x ." . bm-toggle)
               )
#+END_SRC
