init.el

(use-package tramp
  :ensure t
  :init
  (setq tramp-persistency-file-name (concat user-cache-directory "tramp"))
  :config
  (setq tramp-default-method "rsync"))

(if (version<= "26.1" emacs-version)
    ;; emacs 26.1 has display-line-number-mode, which is written in C
    (progn
      (require 'display-line-numbers)
      ;; Only use line number in `prog-mode-hook'
      (add-hook 'prog-mode-hook #'display-line-numbers-mode))
    ;; for emacs version less than 26, use linum instead
    (use-package linum :ensure t :init (global-linum-mode 1)))

;; disble some mode with linum
(use-package linum-off
  :ensure t
  :config
  (setq linum-disabled-mode-list
        '(eshell-mode shell-mode term-mode erc-mode compilation-mode
                      woman-mode w3m-mode calendar-mode org-mode)))

;; for emacs 26.1 or above, we use `display-line-number-mode' instead
(when (version<= "26.1" emacs-version)
  ;; NOTE: overwrite display-line-numbers--turn-on
  (defun display-line-numbers--turn-on ()
    "Turn on `display-line-numbers-mode'."
    (unless (or (minibufferp)
                ;; taken from linum.el
                (and (daemonp) (null (frame-parameter nil 'client)))
                ;; take code from `linum-off'
                (member major-mode linum-disabled-modes-list))
      (display-line-numbers-mode))))

(use-package rainbow-delimiters
  :ensure t
  :config
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))

(use-package recentf
  :straight (:type built-in)
  :init (setq recentf-save-file (expand-file-name "recentf" user-cache-directory))
  :config
  (recentf-mode 1))

(use-package highlight-numbers
  :ensure t
  :config
  ;; json-mode has it's own highlight numbers method
  (add-hook 'prog-mode-hook #'(lambda()
                               (if (not (derived-mode-p 'json-mode))
                                   (highlight-numbers-mode)))))

(use-package highlight-escape-sequences
  :ensure t
  :config
  ;; Make face the same as builtin face
  (put 'font-lock-regexp-grouping-backslash 'face-alias 'font-lock-builtin-face)
  ;; Enable globally
  (hes-mode 1))

(defun font-lock-comment-annotations ()
  "Highlight a bunch of well known comment annotations.
This functions should be added to the hooks of major modes for programming."
  (font-lock-add-keywords
   nil
   '(("\\<\\(FIX\\(ME\\)?\\|BUG\\|HACK\\):" 1 font-lock-warning-face t)
     ("\\<\\(NOTE\\):" 1 'org-level-2 t)
     ("\\<\\(TODO\\):" 1 'org-todo t)
     ("\\<\\(DONE\\):" 1 'org-done t))
   ))

(add-hook 'prog-mode-hook 'font-lock-comment-annotations)

(use-package indent-guide
  :ensure t
  :config
  ;; Only show indent-guide in idle-time.
  (setq indent-guide-delay 0.1))

(show-paren-mode 1)
(setq show-paren-delay 0)               ; no delay

(use-package dtrt-indent
  :ensure t
  :config
  ;; enable dtrt-indent-mode globally
  (dtrt-indent-mode 1))

(use-package whitespace-cleanup-mode
  :ensure t
  :config
  (add-hook 'prog-mode-hook 'whitespace-cleanup-mode))

(use-package edit-server
  :ensure t
  :config
  (edit-server-start))

(setq tab-always-indent 'complete)

(use-package symbol-overlay
  :ensure t
  :config
  (add-hook 'prog-mode-hook #'symbol-overlay-mode)
  ;; (global-set-key (kbd "M-i") 'symbol-overlay-put)
  (define-key symbol-overlay-map (kbd "p") 'symbol-overlay-jump-prev) ;; 次のシンボルへ
  (define-key symbol-overlay-map (kbd "n") 'symbol-overlay-jump-next) ;; 前のシンボルへ
  (define-key symbol-overlay-map (kbd "C-g") 'symbol-overlay-remove-all) ;; ハイライトキャンセル
  )

(setq mouse-wheel-scroll-amount '(1)) ; Distance in pixel-resolution to scroll each mouse wheel event.
(setq mouse-wheel-progressive-speed nil) ; Progressive speed is too fast for me.

(use-package undo-tree
  :ensure t
  :commands (global-undo-tree-mode)
  :config
  ;; Persistent undo-tree history across emacs sessions
  (let ((dir
         (file-name-as-directory (concat user-cache-directory "undo-tree"))))
    (setq undo-tree-history-directory-alist `(("." . ,dir))))
  ;; Make undo-tree save history
  (setq undo-tree-auto-save-history t)
  ;; global enable undo-tree
  (global-undo-tree-mode))

;; Create *scratch* automatically
(run-with-idle-timer 1 t
                     #'(lambda ()
                        (unless (get-buffer "*scratch*")
                          (with-current-buffer (get-buffer-create "*scratch*")
                            (lisp-interaction-mode)))))

(use-package uniquify
  :ensure nil                           ; built-in
  :config
  ;; starting separator for buffer name components
  (setq uniquify-separator " • ")
  ;; rerationalize buffer names after a buffer has been killed.
  (setq uniquify-after-kill-buffer-p t)
  ;; ignore non file buffers
  (setq uniquify-ignore-buffers-re "^\\*"))

(dolist
    (r `(
	   ;; emacs's config.org
	   (?e (file . "~/.emacs.d/init.org"))
	   ;; tasks: todo
	   (?t (file . "~/Org/tasks/todo.org"))
	   ;; tasks: personal
	   (?p (file . "~/Org/tasks/personal.org"))
	   ;; tasks: work
	   (?w (file . "~/Org/tasks/work.org"))
	   ;; Offilce docs
	   (?W (file . "~/Org/Weintek/index.org"))
	   ;; My personal note
	   (?n (file . "~/Org/Note.org"))
	   ;; blogging ideas
	   (?b (file . "~/Org/blog.org"))
	   ;; Finance
	   (?f (file . "~/Org/finance/personal.org"))
	   ))
  (set-register (car r) (cadr r)))

(bind-keys :map my-editor-map
           ;("C-x n" . bm-next)
           ;("C-x p" . bm-previous)
           ;("C-x ." . bm-toggle)
           )

(use-package helm
  :straight t
  :init
