init.org
** Deft for Note-taking

#+BEGIN_SRC emacs-lisp
  (use-package deft
    :ensure t
    :config
    ;; default use org-mode
    (setq deft-default-extension "org")
    ;; default directory set to ~/Org
    (setq deft-directory "~/Org")
    ;; Do not make deft automatically save file
    (setq deft-auto-save-interval 0)
    ;; Recursive search
    (setq deft-recursive t)

    ;; setup an minor-mode to quickly kill all deft buffers
    (define-minor-mode deft-note-mode "Deft notes" nil " Deft-Notes" nil)
    (setq deft-text-mode 'deft-note-mode)

    ;; Quickly kill deft buffers
    (defun my/kill-all-deft-notes ()
      (interactive)
      (save-excursion
        (let ((count 0))
          (dolist (buffer (buffer-list))
            (set-buffer buffer)
            (when (not (eq nil deft-note-mode))
              (setq count (1+ count))
              (kill-buffer buffer))))))

    ;; Enable/Disable defts
    (defun deft-or-close ()
      (interactive)
      (if (or (eq major-mode 'deft-mode) (not (eq nil deft-note-mode)))
          (progn (my/kill-all-deft-notes) (kill-buffer "*Deft*"))
          (deft)))

    (defun my/deft-practice ()
      "Use deft to quickly see my blog drafts."
      (interactive)
      (let ((deft-directory "~/Workspace/practice")
            (deft-extensions '("md" "org"))))
      (deft)))
#+END_SRC

** Make spell-checking tool ignore some org-mode section

see: http://emacs.stackexchange.com/questions/450/intelligent-spell-checking-in-org-mode

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref org-config
  (eval-after-load 'ispell
    '(progn
       (add-to-list 'ispell-skip-region-alist '(":\\(PROPERTIES\\|LOGBOOK\\):" . ":END:"))
       (add-to-list 'ispell-skip-region-alist '("#\\+BEGIN_SRC" . "#\\+END_SRC"))
       ))
#+END_SRC

** Crypt contents in org-mode

#+BEGIN_SRC emacs-lisp
  (use-package org-crypt
    :ensure nil
    :after (org)
    :config
    ;; Disable `auto-save-mode' for org-mode buffer prior to decrypting an entry.
    (setq org-crypt-disable-auto-save t)
    ;; Auto encrypt when save file
    (org-crypt-use-before-save-magic)
    ;; Encrypt with tagname: `secret'
    (setq org-crypt-tag-matcher "secret")
    ;; Prevent the `secret' tag inherit by child
    ;; (The child item still will be encrypt)
    (setq org-tags-exclude-from-inheritance (quote ("secret")))
    ;; Use my own password to encrypt
    (setq org-crypt-key nil))
#+END_SRC

** Drag-and-drop image to your org-mode file

[[https://github.com/abo-abo/org-download][org-download]] will let you drag-and-drop image to your org-mode file easily.

GitHub: https://github.com/abo-abo/org-download

#+BEGIN_SRC emacs-lisp
  (use-package org-download
    :ensure t
    :config
    ;; add support to dired
    (add-hook 'dired-mode-hook 'org-download-enable))
#+END_SRC

** Setup Org-mode Keybindings                                   :keybinding:

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref org-config
  (bind-keys :map org-mode-map
             ("M-p"   . org-previous-visible-heading)
             ("M-n"   . org-next-visible-heading)
             ("C-c a" . org-agenda)
             ("C-c c" . org-capture)
             ("C-c l" . org-store-link)
             ("C-c b" . org-metaleft)
             ("C-c f" . org-metaright)
             ("C-c p" . org-metaup)
             ("C-c n" . org-metadown)
             ("C-c i" . org-insert-link)
             ("C-c I" . org-toggle-inline-images)
             ("C-c %" . org-mark-ring-push)
             ("C-c &" . org-mark-ring-goto)
             ("C-c C-." . org-babel-remove-result-one-or-many))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref org-config
  (bind-keys :map org-src-mode-map
             ("C-c C-c" . org-edit-src-exit))
#+END_SRC

* Programming Languages

** PlantUML                                                       :plantuml:

GitHub: https://github.com/skuro/plantuml-mode

#+BEGIN_SRC emacs-lisp
  (use-package plantuml-mode
    :ensure t
    :mode ("\\.plantuml\\'")
    :init
    ;; FIXME: setup plantuml jar path
    ;; FIXME: add org-mode support
    )
#+END_SRC

** Bison

[[https://www.gnu.org/software/bison/][Bison]] s a general-purpose parser generator that converts an annotated context-free grammar into a deterministic LR or generalized LR (GLR) parser employing LALR(1) parser tables. As an experimental feature, Bison can also generate IELR(1) or canonical LR(1) parser tables. Once you are proficient with Bison, you can use it to develop a wide range of language parsers, from those used in simple desk calculators to complex programming languages.

Bison is upward compatible with Yacc: all properly-written Yacc grammars ought to work with Bison with no change. Anyone familiar with Yacc should be able to use Bison with little trouble. You need to be fluent in C or C++ programming in order to use Bison. Java is also supported as an experimental feature.

#+BEGIN_SRC emacs-lisp
  (use-package bison-mode
    :ensure t
    :mode ("\\.y\\'" "\\.l\\'" "\\.jison\\'"))
#+END_SRC

** GN

[[https://chromium.googlesource.com/chromium/src/tools/gn/+/48062805e19b4697c5fbd926dc649c78b6aaa138/README.md][GN]] is a meta-build system that generates [[https://chromium.googlesource.com/chromium/src/tools/gn/+/48062805e19b4697c5fbd926dc649c78b6aaa138/NinjaBuild.md][NinjaBuild]] files. This system is widely used on Google's chromium related framework.

Take a look on [[https://gn.googlesource.com/gn/+/refs/heads/main/docs/reference.md][GN reference]]  or [[https://chromium.googlesource.com/chromium/src/tools/gn/+/48062805e19b4697c5fbd926dc649c78b6aaa138/docs/quick_start.md][GN Quick Start Guide]] for more info.

#+BEGIN_SRC emacs-lisp
  (use-package gn-mode
    :ensure t
    :mode ("BUILD.gn" "\\.gni?\\'"))
#+END_SRC

** Markdown

[[https://en.wikipedia.org/wiki/Markdown][Markdown]]  is a lightweight markup language with plain text formatting syntax designed so that it can be converted to HTML and many other formats using a tool by the same name. Markdown is often used to format readme files, for writing messages in online discussion forums, and to create rich text using a plain text editor.

Here I use [[http://jblevins.org/projects/markdown-mode/][markdown-mode]] to help me integrate markdown with emacs, the README.md is bind to =gfm-mode= for github's markdown flavor.

#+BEGIN_SRC emacs-lisp :noweb no-export :exports code
  (use-package markdown-mode
    :ensure t
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init (setq markdown-command "multimarkdown")
    :config
    <<markdown-config>>)
#+END_SRC

*** Syntax highlighting on code blocks

[[http://jblevins.org/log/mmm][Syntax highlighting for code blocks in Emacs Markdown Mode]] give us some hint to use =mmm-mode= syntax highlight code block on markdown-mode.

#+BEGIN_SRC emacs-lisp  :tangle no :noweb-ref markdown-config
  ;; http://jblevins.org/log/mmm
  (use-package mmm-mode
    :ensure t
    :config
    (setq mmm-global-mode 'maybe)
    (setq mmm-parse-when-idle 't)
    (defun my/mmm-markdown-auto-class (lang &optional submode)
      "Define a mmm-mode class for LANG in `markdown-mode' using SUBMODE.
  If SUBMODE is not provided, use `LANG-mode' by default."
      (let ((class (intern (concat "markdown-" lang)))
            (submode (or submode (intern (concat lang "-mode"))))
            (front (concat "^```" lang "[\n\r]+"))
            (back "^```"))
        (mmm-add-classes (list (list class :submode submode :front front :back back)))
        (mmm-add-mode-ext-class 'markdown-mode nil class)))

    ;; Mode names that derive directly from the language name
    (mapc 'my/mmm-markdown-auto-class
          '("awk" "bibtex" "c" "cpp" "css" "html" "latex" "lisp" "makefile"
            "markdown" "python" "r" "ruby" "sql" "stata" "xml" "js")))
#+END_SRC

*** Setup Markdown keybinding                                  :keybinding:

 #+BEGIN_SRC emacs-lisp :tangle no :noweb-ref markdown-config
   (bind-keys :map markdown-mode-map
              ("C-c i" . markdown-insert-link))

   (bind-keys :map gfm-mode-map
              ("C-c i" . markdown-insert-link))
#+END_SRC

** NASM

#+BEGIN_SRC emacs-lisp
  (use-package nasm-mode :ensure t)
#+END_SRC

** TOML

[[https://github.com/toml-lang/toml][TOML]] aims to be a minimal configuration file format that's easy to read due to obvious semantics. TOML is designed to map unambiguously to a hash table. TOML should be easy to parse into data structures in a wide variety of languages.

#+BEGIN_SRC emacs-lisp
  (use-package toml-mode
    :ensure t
    :mode "\\.toml$")
#+END_SRC

** YAML

[[https://en.wikipedia.org/wiki/YAML][YAML]] is a human-readable data serialization language. It is commonly used for configuration files, but could be used in many applications where data is being stored (e.g. debugging output) or transmitted (e.g. document headers). YAML targets many of the same communications applications as XML, but has taken a more minimal approach which intentionally breaks compatibility with SGML.

#+BEGIN_SRC emacs-lisp
  (use-package yaml-mode
    :ensure t
    :mode "\\.yml$")
#+END_SRC

** R

#+BEGIN_SRC emacs-lisp :noweb no-export :exports code
  (use-package ess
    :ensure t
    :mode ("\\.[rR]\\'" . R-mode)
    :config
    <<R-config>>)
#+END_SRC

** QML

#+BEGIN_SRC emacs-lisp  :noweb no-export :exports code
  (use-package qml-mode
    :ensure t
    :mode "\\.qml$"
    :config
    <<qml-config>>)
#+END_SRC

*** indent-guide

#+BEGIN_SRC emacs-lisp  :tangle no :noweb-ref qml-config
  (use-package indent-guide
    :ensure t
    :config
    (add-hook 'qml-mode-hook #'indent-guide-mode))
#+END_SRC

** Vala                                                               :vala:

Vala is a new programming language that allows modern programming
techniques to be used to write applications that run on the GNOME
runtime libraries, particularly GLib and GObject.

For more info about vala, please see: [[https://wiki.gnome.org/Projects/Vala/Tutorial][Vala Tutorial]]

#+BEGIN_SRC emacs-lisp  :noweb no-export :exports code
  (use-package vala-mode
    :ensure t
    :mode ("\\.vala\\'" "\\.vapi\\'")
    :config
    <<vala-config>>)
#+END_SRC

** Verilog                                                         :verilog:

#+BEGIN_SRC emacs-lisp  :noweb no-export :exports code
  (use-package verilog-mode
    :mode ("\\.v\\'")
    :config
    <<verilog-config>>)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref verilog-config
  (setq verilog-linter "verilator --lint-only")
  ;; https://github.com/flycheck/flycheck/issues/1250
  (setq flycheck-verilog-verilator-executable "/usr/bin/verilator_bin")
#+END_SRC

** Groovy

#+begin_src emacs-lisp :noweb no-export :exports code
  (use-package groovy-mode
    :mode (("\\.groovy" . groovy-mode)
           ("/Jenkinsfile" . groovy-mode))
    :ensure t)
#+end_src

** Svelete

#+BEGIN_SRC emacs-lisp
  (use-package svelte-mode
    :ensure t
    :mode ("\\.svelte\\'" . svelte-mode))
#+END_SRC

* Configration Files

Since emacs not built-in all configration files syntax highlight support, we need to install manually.

** Docker

#+BEGIN_SRC emacs-lisp
  (use-package dockerfile-mode
    :ensure t
    :mode "Dockerfile\\'")
#+END_SRC

