init.el

(use-package deft
  :ensure t
  :config
  ;; default use org-mode
  (setq deft-default-extension "org")
  ;; default directory set to ~/Org
  (setq deft-directory "~/Org")
  ;; Do not make deft automatically save file
  (setq deft-auto-save-interval 0)
  ;; Recursive search
  (setq deft-recursive t)

  ;; setup an minor-mode to quickly kill all deft buffers
  (define-minor-mode deft-note-mode "Deft notes" nil " Deft-Notes" nil)
  (setq deft-text-mode 'deft-note-mode)

  ;; Quickly kill deft buffers
  (defun my/kill-all-deft-notes ()
    (interactive)
    (save-excursion
      (let ((count 0))
        (dolist (buffer (buffer-list))
          (set-buffer buffer)
          (when (not (eq nil deft-note-mode))
            (setq count (1+ count))
            (kill-buffer buffer))))))

  ;; Enable/Disable defts
  (defun deft-or-close ()
    (interactive)
    (if (or (eq major-mode 'deft-mode) (not (eq nil deft-note-mode)))
        (progn (my/kill-all-deft-notes) (kill-buffer "*Deft*"))
        (deft)))

  (defun my/deft-practice ()
    "Use deft to quickly see my blog drafts."
    (interactive)
    (let ((deft-directory "~/Workspace/practice")
          (deft-extensions '("md" "org"))))
    (deft)))

(use-package org-crypt
  :ensure nil
  :after (org)
  :config
  ;; Disable `auto-save-mode' for org-mode buffer prior to decrypting an entry.
  (setq org-crypt-disable-auto-save t)
  ;; Auto encrypt when save file
  (org-crypt-use-before-save-magic)
  ;; Encrypt with tagname: `secret'
  (setq org-crypt-tag-matcher "secret")
  ;; Prevent the `secret' tag inherit by child
  ;; (The child item still will be encrypt)
  (setq org-tags-exclude-from-inheritance (quote ("secret")))
  ;; Use my own password to encrypt
  (setq org-crypt-key nil))

(use-package org-download
  :ensure t
  :config
  ;; add support to dired
  (add-hook 'dired-mode-hook 'org-download-enable))

(use-package plantuml-mode
  :ensure t
  :mode ("\\.plantuml\\'")
  :init
  ;; FIXME: setup plantuml jar path
  ;; FIXME: add org-mode support
  )

(use-package bison-mode
  :ensure t
  :mode ("\\.y\\'" "\\.l\\'" "\\.jison\\'"))

(use-package gn-mode
  :ensure t
  :mode ("BUILD.gn" "\\.gni?\\'"))

(use-package markdown-mode
  :ensure t
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown")
  :config
  ;; http://jblevins.org/log/mmm
  (use-package mmm-mode
    :ensure t
    :config
    (setq mmm-global-mode 'maybe)
    (setq mmm-parse-when-idle 't)
    (defun my/mmm-markdown-auto-class (lang &optional submode)
      "Define a mmm-mode class for LANG in `markdown-mode' using SUBMODE.
  If SUBMODE is not provided, use `LANG-mode' by default."
      (let ((class (intern (concat "markdown-" lang)))
            (submode (or submode (intern (concat lang "-mode"))))
            (front (concat "^```" lang "[\n\r]+"))
            (back "^```"))
        (mmm-add-classes (list (list class :submode submode :front front :back back)))
        (mmm-add-mode-ext-class 'markdown-mode nil class)))
  
    ;; Mode names that derive directly from the language name
    (mapc 'my/mmm-markdown-auto-class
          '("awk" "bibtex" "c" "cpp" "css" "html" "latex" "lisp" "makefile"
            "markdown" "python" "r" "ruby" "sql" "stata" "xml" "js")))
  (bind-keys :map markdown-mode-map
             ("C-c i" . markdown-insert-link))
  
  (bind-keys :map gfm-mode-map
             ("C-c i" . markdown-insert-link)))

(use-package nasm-mode :ensure t)

(use-package toml-mode
  :ensure t
  :mode "\\.toml$")

(use-package yaml-mode
  :ensure t
  :mode "\\.yml$")

(use-package ess
  :ensure t
  :mode ("\\.[rR]\\'" . R-mode)
  :config
  )

(use-package qml-mode
  :ensure t
  :mode "\\.qml$"
  :config
  (use-package indent-guide
    :ensure t
    :config
    (add-hook 'qml-mode-hook #'indent-guide-mode)))

(use-package vala-mode
  :ensure t
  :mode ("\\.vala\\'" "\\.vapi\\'")
  :config
  )

(use-package verilog-mode
  :mode ("\\.v\\'")
  :config
  (setq verilog-linter "verilator --lint-only")
  ;; https://github.com/flycheck/flycheck/issues/1250
  (setq flycheck-verilog-verilator-executable "/usr/bin/verilator_bin"))

(use-package groovy-mode
  :mode (("\\.groovy" . groovy-mode)
         ("/Jenkinsfile" . groovy-mode))
  :ensure t)

(use-package svelte-mode
  :ensure t
  :mode ("\\.svelte\\'" . svelte-mode))

(use-package dockerfile-mode
  :ensure t
  :mode "Dockerfile\\'")
