init.org
*** Packages we need to install in system

To make emacs work with javascript more nicer, we need to install some packages in system.

**** tern

=tern= for auto-completion and documentation features:

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref install-in-all
  npm install -g tern
#+END_SRC

**** eslint

We also install =eslint= with babel and react support, to use =eslint= you need to add =.eslintrc= to your project, here's a good example: [[https://github.com/airbnb/javascript/blob/master/linters/.eslintrc][.eslintrc]] .

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref install-in-all
  npm install -g eslint babel-eslint eslint-plugin-react
#+END_SRC

**** jsxhint

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref install-in-all
  npm install -g jsxhint
#+END_SRC

ref: http://umi-uyura.hatenablog.com/entry/2015/05/13/214629

**** js-beautify

Finally, install =js-beautify= to do automatic code formatting:

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref install-in-all
  npm install -g js-beautify
#+END_SRC

Be sure to have the =e4x= option set to true on your =.jsbeautifyrc= here it is my configuration as an example:

#+BEGIN_SRC json :tangle no
  {
    "indent_size": 2,
    "indent_char": " ",
    "eol": "\n",
    "indent_level": 0,
    "indent_with_tabs": false,
    "preserve_newlines": true,
    "max_preserve_newlines": 2,
    "jslint_happy": false,
    "space_after_anon_function": false,
    "brace_style": "collapse",
    "keep_array_indentation": false,
    "keep_function_indentation": false,
    "space_before_conditional": true,
    "break_chained_methods": true,
    "eval_code": false,
    "unescape_strings": false,
    "wrap_line_length": 80,
    "wrap_attributes": "auto",
    "wrap_attributes_indent_size": 2,
    "e4x": true,
    "end_with_newline": true
  }
#+END_SRC

*** Simplify importing JS modules

=import-js= is a tool to automatically import dependencies in your JavaScript
project. Use it in Vim or Emacs by placing your cursor on a variable and hit
=<leader>j (Vim)=, or =(M-x) import-js-import (Emacs)=.

GitHub: https://github.com/trotzig/import-js

#+BEGIN_SRC emacs-lisp
  (use-package import-js :ensure t)
#+END_SRC

** json

#+BEGIN_SRC emacs-lisp
  (use-package json-mode :ensure t
    :mode "\\.json\\'")
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package json-reformat :ensure t :commands json-reformat-region)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package flymake-json :ensure t
    :config
    (add-hook 'json-mode-hook (lambda () (flymake-json-load))))
#+END_SRC

** po

#+BEGIN_SRC emacs-lisp
  (use-package po-mode :ensure t
    :mode "\\.po\\'\\|\\.po\\."
    :config

    ;; To use the right coding system automatically under Emacs 20 or newer,
    ;; also add:
    (when (require 'po nil 'noerror)
      (modify-coding-system-alist 'file "\\.po\\'\\|\\.po\\."
                                  'po-find-file-coding-system))
    )
#+END_SRC

** python

#+BEGIN_SRC emacs-lisp
  (use-package python
    :mode (("SCons\\(truct\\|cript\\)\\'" . python-mode)
           ("DEPS" . python-mode)))
#+END_SRC

** ruby

#+BEGIN_SRC emacs-lisp
  (use-package ruby-mode
    :ensure nil				; built-in
    :mode (("Gemfile\\'"  . ruby-mode)
           ("Kirkfile\\'" . ruby-mode)
           ("Rakefile\\'" . ruby-mode)
           ("Vagrantfile\\'" . ruby-mode)
           ("\\.builder\\'"  . ruby-mode)
           ("\\.gemspec\\'"  . ruby-mode)
           ("\\.irbrc\\'" . ruby-mode)
           ("\\.pryrc\\'" . ruby-mode)
           ("\\.rake\\'"  . ruby-mode)
           ("\\.rjs\\'"   . ruby-mode)
           ("\\.ru\\'"    . ruby-mode)
           ("\\.rxml\\'"  . ruby-mode))
    :config
    ;; We never want to edit Rubinius bytecode
    (add-to-list 'completion-ignored-extensions ".rbc"))
#+END_SRC
** go

#+BEGIN_SRC emacs-lisp  :noweb no-export
  (use-package go-mode
    :ensure t
    :config
    <<go-mode-config>>)
#+END_SRC

*** Auto completion support

#+BEGIN_SRC emacs-lisp :noweb-ref go-mode-config
  (use-package company-go
    :ensure t
    :config
    (defun my/setup-go-mode-company-go ()
      "Hook for running on company-go"
      ;; we only want to use company-go - it's so accurate we won't need
      ;; any other completion engines
      (set (make-local-variable 'company-backends) '(company-go)))
    (add-hook 'go-mode-hook 'my/setup-go-mode-company-go))
#+END_SRC

*** Use gofmt fotmat codes before save

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref go-mode-config
  (defun my/setup-go-mode-gofmt-hook ()
    ;; Use goimports instead of go-fmt
    (setq gofmt-command "goimports")
    ;; Call Gofmt before saving
    (add-hook 'before-save-hook 'gofmt-before-save))
  (add-hook 'go-mode-hook 'my/setup-go-mode-gofmt-hook)
#+END_SRC

*** Setup Go Keybinding                                        :keybinding:

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref go-mode-config
  (bind-keys :map go-mode-map
             ("M-." . godef-jump))
#+END_SRC

** nxml

#+BEGIN_SRC emacs-lisp
  (use-package nxml-mode
    :ensure nil                  ; emacs built-in
    :mode (("\\.plist\\'" . nxml-mode)
           ("\\.rss\\'"   . nxml-mode)
           ("\\.svg\\'"   . nxml-mode)
           ("\\.xml\\'"   . nxml-mode)
           ("\\.xsd\\'"   . nxml-mode)
           ("\\.xslt\\'"  . nxml-mode)
           ("\\.pom$"     . nxml-mode))
    :config
    ;; Any file start with xml will be treat as nxml-mode
    (add-to-list 'magic-mode-alist '("<\\?xml" . nxml-mode))
    ;; Use nxml-mode instead of sgml, xml or html mode.
    (mapc
     (lambda (pair)
       (if (or (eq (cdr pair) 'xml-mode)
               (eq (cdr pair) 'sgml-mode))
           (setcdr pair 'nxml-mode)))
     auto-mode-alist))
#+END_SRC


* TODO LISP Development                                                :lisp:

Though =LISP= has many dialet, it still is the best programming
language I ever met.

** Plugins

Common setup for LISP development.

*** lispy

This package reimagines Paredit - a popular method to navigate and edit LISP code in Emacs.

GitHub: https://github.com/abo-abo/lispy

For more info to control lispy, please refer: http://oremacs.com/lispy/

#+BEGIN_SRC emacs-lisp
  (use-package lispy
    :ensure t
    :config

    (defun my/up-list (&optional arg)
      "My special lisp moving stragedy."
      (interactive)
      (or arg (setq arg -1))
      (condition-case ex
          (up-list arg)
        ('error (progn
                  (lispy-backward arg)
                  (beginning-of-line)
                  (up-list arg)))))

    (defun my/down-list (&optional arg)
      "My special lisp moving stragedy."
      (interactive)
      (or arg (setq arg 1))
      (condition-case ex
          (down-list arg)
        ('error (progn
                  (lispy-forward arg)
                  (end-of-line)
                  (down-list arg)))))

    ;; My special hack for lispy-mode
    (defun my/lispy-mode ()
      (lispy-mode 1)
      ;; `M-m' is preserved for mode setting
      (define-key lispy-mode-map (kbd "M-m") nil)
      ;; `M-s' is for my search command, rebind to `C-c s'
      (define-key lispy-mode-map (kbd "M-s") nil)
      (define-key lispy-mode-map (kbd "C-c s") 'lispy-splice)
      ;; `[' and `]' just insert them
      (define-key lispy-mode-map (kbd "[") 'lispy-open-square)
      (define-key lispy-mode-map (kbd "]") 'lispy-close-square)
      ;; My special lisp moving cmd
      (define-key lispy-mode-map (kbd "C-M-f") 'my/down-list)
      (define-key lispy-mode-map (kbd "C-M-b") 'my/up-list))

    (add-hook 'emacs-lisp-mode-hook #'my/lispy-mode)
    (add-hook 'lisp-interaction-mode-hook #'my/lispy-mode)
    (add-hook 'clojure-mode-hook #'my/lispy-mode)
    (add-hook 'scheme-mode-hook #'my/lispy-mode)
    (add-hook 'lisp-mode-hook #'my/lispy-mode))
#+END_SRC
*** indent-guide

#+BEGIN_SRC emacs-lisp
  (use-package indent-guide
    :ensure t
    :config
    (add-hook 'emacs-lisp-mode-hook #'indent-guide-mode)
    (add-hook 'lisp-interaction-mode-hook #'indent-guide-mode)
    (add-hook 'clojure-mode-hook #'indent-guide-mode)
    (add-hook 'scheme-mode-hook #'indent-guide-mode)
    (add-hook 'lisp-mode-hook #'indent-guide-mode))
#+END_SRC

*** Prettify symbols

Show lambda as λ.

#+BEGIN_SRC emacs-lisp
  (global-prettify-symbols-mode 1)
#+END_SRC

* Web Development                                                       :web:

#+BEGIN_SRC emacs-lisp
  (use-package web-mode
    :ensure t
    :mode (("\\.html?\\'" . web-mode)
           ("\\.ejs?\\'" . web-mode)))
#+END_SRC

** CSS                                                                 :css:

#+BEGIN_SRC emacs-lisp
  (use-package css-mode
    :ensure nil				; built-in
    :mode "\\.css\\'")
#+END_SRC

*** Add support for eldoc                                           :eldoc:

#+BEGIN_SRC emacs-lisp
  (use-package css-eldoc
    :ensure t
    :config
    (add-hook 'css-mode-hook 'turn-on-css-eldoc)
    (add-hook 'scss-mode-hook 'turn-on-css-eldoc)
    (add-hook 'less-css-mode-hook 'turn-on-css-eldoc))
#+END_SRC

** Less                                                               :less:

#+BEGIN_SRC emacs-lisp
  (use-package less-css-mode
    :ensure t
    :mode ("\\.less$" . less-css-mode))
#+END_SRC

** SCSS                                                           :css:scss:

#+BEGIN_SRC emacs-lisp
  (use-package scss-mode
    :ensure t
    :mode "\\.scss\\'"
    :config
    ;; dont' build scss to css after save file
    (setq scss-compile-at-save nil))
#+END_SRC

** mustache                                                       :mustache:

Sometimes we will use [[https://mustache.github.io/][mustache]] as template system, [[https://github.com/mustache/emacs][mustache-mode]] is a nice
helper.

GitHub: https://github.com/mustache/emacs

#+BEGIN_SRC emacs-lisp
  (use-package mustache-mode :mode "\\.mustache$" :ensure t)
#+END_SRC

