init.el

(use-package import-js :ensure t)

(use-package json-mode :ensure t
  :mode "\\.json\\'")

(use-package json-reformat :ensure t :commands json-reformat-region)

(use-package flymake-json :ensure t
  :config
  (add-hook 'json-mode-hook (lambda () (flymake-json-load))))

(use-package po-mode :ensure t
  :mode "\\.po\\'\\|\\.po\\."
  :config

  ;; To use the right coding system automatically under Emacs 20 or newer,
  ;; also add:
  (when (require 'po nil 'noerror)
    (modify-coding-system-alist 'file "\\.po\\'\\|\\.po\\."
                                'po-find-file-coding-system))
  )

(use-package python
  :mode (("SCons\\(truct\\|cript\\)\\'" . python-mode)
         ("DEPS" . python-mode)))

(use-package ruby-mode
  :ensure nil				; built-in
  :mode (("Gemfile\\'"  . ruby-mode)
         ("Kirkfile\\'" . ruby-mode)
         ("Rakefile\\'" . ruby-mode)
         ("Vagrantfile\\'" . ruby-mode)
         ("\\.builder\\'"  . ruby-mode)
         ("\\.gemspec\\'"  . ruby-mode)
         ("\\.irbrc\\'" . ruby-mode)
         ("\\.pryrc\\'" . ruby-mode)
         ("\\.rake\\'"  . ruby-mode)
         ("\\.rjs\\'"   . ruby-mode)
         ("\\.ru\\'"    . ruby-mode)
         ("\\.rxml\\'"  . ruby-mode))
  :config
  ;; We never want to edit Rubinius bytecode
  (add-to-list 'completion-ignored-extensions ".rbc"))

(use-package go-mode
  :ensure t
  :config
  (use-package company-go
    :ensure t
    :config
    (defun my/setup-go-mode-company-go ()
      "Hook for running on company-go"
      ;; we only want to use company-go - it's so accurate we won't need
      ;; any other completion engines
      (set (make-local-variable 'company-backends) '(company-go)))
    (add-hook 'go-mode-hook 'my/setup-go-mode-company-go))
  (defun my/setup-go-mode-gofmt-hook ()
    ;; Use goimports instead of go-fmt
    (setq gofmt-command "goimports")
    ;; Call Gofmt before saving
    (add-hook 'before-save-hook 'gofmt-before-save))
  (add-hook 'go-mode-hook 'my/setup-go-mode-gofmt-hook)
  (bind-keys :map go-mode-map
             ("M-." . godef-jump)))

(use-package company-go
  :ensure t
  :config
  (defun my/setup-go-mode-company-go ()
    "Hook for running on company-go"
    ;; we only want to use company-go - it's so accurate we won't need
    ;; any other completion engines
    (set (make-local-variable 'company-backends) '(company-go)))
  (add-hook 'go-mode-hook 'my/setup-go-mode-company-go))

(use-package nxml-mode
  :ensure nil                  ; emacs built-in
  :mode (("\\.plist\\'" . nxml-mode)
         ("\\.rss\\'"   . nxml-mode)
         ("\\.svg\\'"   . nxml-mode)
         ("\\.xml\\'"   . nxml-mode)
         ("\\.xsd\\'"   . nxml-mode)
         ("\\.xslt\\'"  . nxml-mode)
         ("\\.pom$"     . nxml-mode))
  :config
  ;; Any file start with xml will be treat as nxml-mode
  (add-to-list 'magic-mode-alist '("<\\?xml" . nxml-mode))
  ;; Use nxml-mode instead of sgml, xml or html mode.
  (mapc
   (lambda (pair)
     (if (or (eq (cdr pair) 'xml-mode)
             (eq (cdr pair) 'sgml-mode))
         (setcdr pair 'nxml-mode)))
   auto-mode-alist))

(use-package lispy
  :ensure t
  :config

  (defun my/up-list (&optional arg)
    "My special lisp moving stragedy."
    (interactive)
    (or arg (setq arg -1))
    (condition-case ex
        (up-list arg)
      ('error (progn
                (lispy-backward arg)
                (beginning-of-line)
                (up-list arg)))))

  (defun my/down-list (&optional arg)
    "My special lisp moving stragedy."
    (interactive)
    (or arg (setq arg 1))
    (condition-case ex
        (down-list arg)
      ('error (progn
                (lispy-forward arg)
                (end-of-line)
                (down-list arg)))))

  ;; My special hack for lispy-mode
  (defun my/lispy-mode ()
    (lispy-mode 1)
    ;; `M-m' is preserved for mode setting
    (define-key lispy-mode-map (kbd "M-m") nil)
    ;; `M-s' is for my search command, rebind to `C-c s'
    (define-key lispy-mode-map (kbd "M-s") nil)
    (define-key lispy-mode-map (kbd "C-c s") 'lispy-splice)
    ;; `[' and `]' just insert them
    (define-key lispy-mode-map (kbd "[") 'lispy-open-square)
    (define-key lispy-mode-map (kbd "]") 'lispy-close-square)
    ;; My special lisp moving cmd
    (define-key lispy-mode-map (kbd "C-M-f") 'my/down-list)
    (define-key lispy-mode-map (kbd "C-M-b") 'my/up-list))

  (add-hook 'emacs-lisp-mode-hook #'my/lispy-mode)
  (add-hook 'lisp-interaction-mode-hook #'my/lispy-mode)
  (add-hook 'clojure-mode-hook #'my/lispy-mode)
  (add-hook 'scheme-mode-hook #'my/lispy-mode)
  (add-hook 'lisp-mode-hook #'my/lispy-mode))

(use-package indent-guide
  :ensure t
  :config
  (add-hook 'emacs-lisp-mode-hook #'indent-guide-mode)
  (add-hook 'lisp-interaction-mode-hook #'indent-guide-mode)
  (add-hook 'clojure-mode-hook #'indent-guide-mode)
  (add-hook 'scheme-mode-hook #'indent-guide-mode)
  (add-hook 'lisp-mode-hook #'indent-guide-mode))

(global-prettify-symbols-mode 1)

(use-package web-mode
  :ensure t
  :mode (("\\.html?\\'" . web-mode)
         ("\\.ejs?\\'" . web-mode)))

(use-package css-mode
  :ensure nil				; built-in
  :mode "\\.css\\'")

(use-package css-eldoc
  :ensure t
  :config
  (add-hook 'css-mode-hook 'turn-on-css-eldoc)
  (add-hook 'scss-mode-hook 'turn-on-css-eldoc)
  (add-hook 'less-css-mode-hook 'turn-on-css-eldoc))

(use-package less-css-mode
  :ensure t
  :mode ("\\.less$" . less-css-mode))

(use-package scss-mode
  :ensure t
  :mode "\\.scss\\'"
  :config
  ;; dont' build scss to css after save file
  (setq scss-compile-at-save nil))

(use-package mustache-mode :mode "\\.mustache$" :ensure t)
