init.el

(let ((secret "~/.personal.el"))
  (when (file-exists-p secret) (load-file secret)))
